Test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">startnextloop</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">900</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
          <collectionProp name="CookieManager.cookies"/>
          <boolProp name="CookieManager.clearEachIteration">true</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
        </CookieManager>
        <hashTree/>
        <CacheManager guiclass="CacheManagerGui" testclass="CacheManager" testname="HTTP Cache Manager" enabled="true">
          <boolProp name="clearEachIteration">true</boolProp>
          <boolProp name="useExpires">true</boolProp>
          <boolProp name="CacheManager.controlledByThread">false</boolProp>
        </CacheManager>
        <hashTree/>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="User-service" elementType="Argument">
              <stringProp name="Argument.name">User-service</stringProp>
              <stringProp name="Argument.value">b-accel-user.b-accel.internal</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
              <stringProp name="Argument.desc">localhost</stringProp>
            </elementProp>
            <elementProp name="port" elementType="Argument">
              <stringProp name="Argument.name">port</stringProp>
              <stringProp name="Argument.value">80</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
              <stringProp name="Argument.desc">5001</stringProp>
            </elementProp>
          </collectionProp>
          <stringProp name="TestPlan.comments">/usr/bin/Jmeter/LoadTest/Logs/</stringProp>
        </Arguments>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="filename">/usr/bin/Jmeter/LoadTest/Users_Feb17.csv</stringProp>
          <stringProp name="variableNames">email</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <kg.apc.jmeter.timers.VariableThroughputTimer guiclass="kg.apc.jmeter.timers.VariableThroughputTimerGui" testclass="kg.apc.jmeter.timers.VariableThroughputTimer" testname="jp@gc - Throughput Shaping Timer" enabled="false">
          <collectionProp name="load_profile">
            <collectionProp name="-1147503684">
              <stringProp name="49">1</stringProp>
              <stringProp name="48625">100</stringProp>
              <stringProp name="48687">120</stringProp>
            </collectionProp>
            <collectionProp name="-1875958267">
              <stringProp name="48625">100</stringProp>
              <stringProp name="48625">100</stringProp>
              <stringProp name="56313">900</stringProp>
            </collectionProp>
            <collectionProp name="-1874504498">
              <stringProp name="48625">100</stringProp>
              <stringProp name="49586">200</stringProp>
              <stringProp name="48687">120</stringProp>
            </collectionProp>
            <collectionProp name="-809964987">
              <stringProp name="49586">200</stringProp>
              <stringProp name="49586">200</stringProp>
              <stringProp name="56313">900</stringProp>
            </collectionProp>
            <collectionProp name="-90188704">
              <stringProp name="49586">200</stringProp>
              <stringProp name="50547">300</stringProp>
              <stringProp name="48687">120</stringProp>
            </collectionProp>
            <collectionProp name="1767512261">
              <stringProp name="50547">300</stringProp>
              <stringProp name="50547">300</stringProp>
              <stringProp name="56313">900</stringProp>
            </collectionProp>
            <collectionProp name="1769712727">
              <stringProp name="50547">300</stringProp>
              <stringProp name="51508">400</stringProp>
              <stringProp name="48687">120</stringProp>
            </collectionProp>
            <collectionProp name="-1437567451">
              <stringProp name="51508">400</stringProp>
              <stringProp name="51508">400</stringProp>
              <stringProp name="56313">900</stringProp>
            </collectionProp>
            <collectionProp name="-1436113682">
              <stringProp name="51508">400</stringProp>
              <stringProp name="52469">500</stringProp>
              <stringProp name="48687">120</stringProp>
            </collectionProp>
            <collectionProp name="-371574171">
              <stringProp name="52469">500</stringProp>
              <stringProp name="52469">500</stringProp>
              <stringProp name="56313">900</stringProp>
            </collectionProp>
            <collectionProp name="-369349618">
              <stringProp name="52469">500</stringProp>
              <stringProp name="53430">600</stringProp>
              <stringProp name="48687">120</stringProp>
            </collectionProp>
            <collectionProp name="719084197">
              <stringProp name="53430">600</stringProp>
              <stringProp name="53430">600</stringProp>
              <stringProp name="56313">900</stringProp>
            </collectionProp>
            <collectionProp name="720537966">
              <stringProp name="53430">600</stringProp>
              <stringProp name="54391">700</stringProp>
              <stringProp name="48687">120</stringProp>
            </collectionProp>
            <collectionProp name="1785077477">
              <stringProp name="54391">700</stringProp>
              <stringProp name="54391">700</stringProp>
              <stringProp name="56313">900</stringProp>
            </collectionProp>
            <collectionProp name="1787277943">
              <stringProp name="54391">700</stringProp>
              <stringProp name="55352">800</stringProp>
              <stringProp name="48687">120</stringProp>
            </collectionProp>
            <collectionProp name="-1420002235">
              <stringProp name="55352">800</stringProp>
              <stringProp name="55352">800</stringProp>
              <stringProp name="56313">900</stringProp>
            </collectionProp>
            <collectionProp name="-1417801769">
              <stringProp name="55352">800</stringProp>
              <stringProp name="56313">900</stringProp>
              <stringProp name="48687">120</stringProp>
            </collectionProp>
            <collectionProp name="-330114651">
              <stringProp name="56313">900</stringProp>
              <stringProp name="56313">900</stringProp>
              <stringProp name="56313">900</stringProp>
            </collectionProp>
            <collectionProp name="-1730935240">
              <stringProp name="56313">900</stringProp>
              <stringProp name="1507423">1000</stringProp>
              <stringProp name="48687">120</stringProp>
            </collectionProp>
            <collectionProp name="-254668836">
              <stringProp name="1507423">1000</stringProp>
              <stringProp name="1000">1000</stringProp>
              <stringProp name="56313">900</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.timers.VariableThroughputTimer>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Get User" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="email" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">${email}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">email</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${User-service}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/user</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="accept" elementType="Header">
                <stringProp name="Header.name">accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="519081716">NEWLY_REGISTERED</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">/usr/bin/Jmeter/LoadTest/Logs/Test_${__time(MMMdd,)}.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>